package wave_algoritm_java;

public class wave_cod {
    public static void main(String[] args) {
        
        int i = 0;
        int j = 0;
        int z = 0;
        int k = 0;
 
        int Ni = 0;   //Счетчик волн
        // int Nk = 254; //Примерное количество ходов для поиска
        int n = 10;   //Размер массива

        //Создаем массив для поиска путей. 
        int lab[][] = { 
        {254, 254, 254, 254, 254, 254, 254, 254, 254, 254},
        {254, 254, 254, 254, 254, 254, 254, 254, 254, 254},
        {254, 254, 254, 254, 254, 254, 254, 254, 254, 254},
        {254, 254, 254, 255, 255, 254, 254, 254, 254, 254},
        {254, 254, 253, 255, 254, 254, 254, 254, 254, 254},
        {254, 254, 254, 255, 254, 0, 254, 254, 254, 254},
        {254, 254, 254, 255, 254, 254, 254, 254, 254, 254},
        {254, 254, 254, 255, 255, 254, 254, 254, 254, 254},
        {254, 254, 254, 254, 254, 254, 254, 254, 254, 254},
        {254, 254, 254, 254, 254, 254, 254, 254, 254, 254},
        {254, 254, 254, 254, 254, 254, 254, 254, 254, 254}};
         
        //Создаю три цикла.
        //Первый цикл по размеру массива.
         
        label : for (int l = 0; l < 254; l++){
            for (i = 0; i < n; i++){ 
                for (j = 0; j < n; j++){
                    if (lab[i][j] == Ni && i > 0 && i < n && j > 0 && j < n-1){    //Условия, чтоб не заскочить за край цикла
         
        //Четыре условия для поиска нужного значения вокруг точки
        //и для перехода на следующий гребень волны.
                    if(lab[i][j+1] == 254){
                        lab[i][j+1] = Ni+1;
                    }
                    if(lab[i][j+1]== 253){
                        z = i;
                        k = j+1;
                        break label;
                    }
         
                    if(lab[i+1][j] == 254){
                        lab[i+1][j] = Ni+1;
                    }
                    if(lab[i+1][j]== 253){
                        z = i+1;
                        k = j;
                        break label; 
                    }
                    if(lab[i][j-1] == 254){
                        lab[i][j-1] = Ni+1;
                    }
                    if(lab[i][j-1] == 253){
                        z = i;
                        k = j-1;
                        break label; 
                    }
                    if(lab[i-1][j] == 254){
                        lab[i-1][j] = Ni+1;
                    }
                    if(lab[i-1][j] == 253){
                        z = i-1;
                        k = j;
                        break label;
                    } 
                }
            }
        }
        Ni++;
    } 
        //Цикл для волны
        for (i = 0; i < n; i++){
            for (j = 0; j < n; j++){
                System.out.printf("%4d", lab[i][j]);
            }
            System.out.println();
        }
         
    }
}
